CCB_RANS1_1_10ms/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;//一个网格代表多少米

vertices//点坐标（从0点开始）
(
    (-3 0 -2)
    (12 0 -2)
    (-3 1.5 -2)
    (12 1.5 -2)
    (-3 0 6.2)
    (12 0 6.2)
    (-3 1.5 6.2)
    (12 1.5 6.2)
    
);

blocks//网格
(
    hex (0 1 3 2 4 5 7 6)(750 75 410)simpleGrading (1 1 1)//网格 （网格的8个顶点）（网格的x,y,z方向的网格数量）（x,y,z方向的膨胀率）
);


boundary//边界条件
(
    inlet//入口
    {
        type patch;
        faces
        (
            (0 2 6 4)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 3 7 5)
        );
    }
    
    top
    {
        type wall;
        faces
        (
            (2 3 7 6)
            
        );
    }
    
    bottom
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
    


    frontAndBack
    {
        type wall;
        //neighbourPatch  back;
        faces
        (
            (0 1 3 2)
            (4 5 7 6)
        );
    }
    

);

mergePatchPairs
(
);

// ************************************************************************* //
