CCB_RANS1_1_10ms/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Which of the steps to run
castellatedMesh true;
snap            true;
addLayers       false;


// Geometry. Definition of all surfaces. All surfaces are of class
// searchableSurface.
// Surfaces are used
// - to specify refinement for any mesh cell intersecting it
// - to specify refinement for any mesh cell inside/outside/near
// - to 'snap' the mesh boundary to the surface
geometry
{
    CB.stl
    {
        type triSurfaceMesh;
        name CB;
    }
};

  refinementBox1
    {
        type searchableBox;
        min (-0.2 0 -0.2);
        max (4.4 0.34 4.4);
    }
castellatedMeshControls
{
    maxLocalCells 50000000;

    maxGlobalCells 80000000;

    minRefinementCells 10;

    maxLoadUnbalance 0.10;

    nCellsBetweenLevels 3;


    features
    (
        {
            file "CB.eMesh";
            level 2;
        }
    );

    refinementSurfaces
    {
        CB
        {
            // Surface-wise min and max refinement level
            level (1 2);

        }
    }

    resolveFeatureAngle 30;


 

    refinementRegions
    {
        CB
        {
            mode inside;
            levels ((1 2));
        }

    }

    locationInMesh (0.1 0.2 0.1);

    allowFreeStandingZoneFaces true;
}



// Settings for the snapping.
snapControls
{

    nSmoothPatch 10;

    tolerance 2.0;

    nSolveIter 100;

    nRelaxIter 5;

    nFeatureSnapIter 10;

    implicitFeatureSnap false;

    explicitFeatureSnap true;

    multiRegionFeatureSnap true;
}



// Settings for the layer addition.
addLayersControls
{
    relativeSizes true;

    layers
    {
        "CB_*"
        {
            nSurfaceLayers 3;
        }
    }

    expansionRatio 1.0;

    finalLayerThickness 0.3;

    minThickness 0.1;

    nGrow 0;

    featureAngle 60;

    slipFeatureAngle 30;

    nRelaxIter 3;

    nSmoothSurfaceNormals 1;

    nSmoothNormals 3;

    nSmoothThickness 10;

    maxFaceThicknessRatio 0.5;

    maxThicknessToMedialRatio 0.3;

    minMedianAxisAngle 90;

    nBufferCellsNoExtrude 0;

    nLayerIter 50;
}


meshQualityControls
{
    maxNonOrtho 65;

    maxInternalSkewness 4;

    maxConcave 80;

    minVol 1e-13;

    minTetQuality 1e-30;

    minArea -1;

    minTwist 0.05;

    minDeterminant 0.001;

    minFaceWeight 0.02;

    minVolRatio 0.01;

    minTriangleTwist -1;

    nSmoothScale 4;

    errorReduction 0.75;

    maxBoundarySkewness    0;

}

writeFlags
(
    scalarLevels
    layerSets
    layerFields     // write volScalarField for layer coverage
);

mergeTolerance 1e-6;


// ************************************************************************* //
