CCB_RANS1_1_10ms/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Uinlet          (0 0 0);

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            codedFixedValue;
        name		dummy;
        value           uniform (0 0 0);
        
        redirectType    inletVelocityProfile;
        code
        #{
             const vectorField& Cf = patch().Cf(); 

             const scalar H	= 0.8761; 
             const scalar Umax  = 4.4483; 

             forAll(Cf, faceI) // loop over all the patch faces
             { 
                (*this)[faceI] = vector(H*log(Cf[faceI].y()*100)+Umax, 0, 0);
             }
         #};
    }

    outlet
    {
        //type            pressureInletOutletVelocity;
        //value           uniform (0 0 0);
        type              zeroGradient;
    }

    top
    {
        type             slip;
    }
    
    bottom
    {
        //type            noSlip;
        type            fixedValue;
        value           uniform (0 0 0);
    }
    
    CB
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    
    frontAndBack
    {
        type             slip;
    }
    
 

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
