CCB_RANS1_1_10ms/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        /*type            fixedValue;
        value           uniform  0;*/
        type            zeroGradient;
    }

    outlet
    {
        /*type            totalPressure;
        p0              uniform 0;
        gamma           1.4;
        value           uniform 0;*/
        type            fixedValue;
        value           uniform 0;
    }

    top
    {
        //type            fixedFluxPressure;
        //value           uniform 0;
        type            zeroGradient;
    }
    
    bottom
    {
        //type            fixedFluxPressure;
        //value           uniform 0;
        type            zeroGradient;
    }
    
    CB
    {
        //type            fixedFluxPressure;
        //value           uniform 0.1;
        type            zeroGradient;
    }
    
    frontAndBack
    {
       // type            empty;
       type            zeroGradient;
    }


    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
