CCB_RANS1_1_10ms/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

kInlet          0.375;   // approx k = 1.5*(I*U)^2 ; I = 0.1

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $kInlet;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform $kInlet;
    }

    outlet
    {
        type            zeroGradient;
    }

    top
    {
        type            zeroGradient;
    }
    
    bottom
    {
        type            kqRWallFunction;
        value           uniform $kInlet;
    }
    
    CB
    {
        type            kqRWallFunction;
        value           uniform $kInlet;
    }
    
    frontAndBack
    {
        //type            empty;
        type            kqRWallFunction;
        value           uniform $kInlet;
    }
    


    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
