CCB_RANS1_1_10ms/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.32;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0.32;
    }

    outlet
    {
        type            calculated;
        value           uniform 0.32;
    }

    top
    {
        type            nutkWallFunction;
        value           uniform 0;
        //type            zeroGradient;
    }
    
    bottom
    {
        type            nutkRoughWallFunction;
        Ks              uniform 0.003; // 流沙地表
        Cs              uniform 0.5;
        value           uniform 0;    
    }
    
    CB
    {
        type            nutkRoughWallFunction;
        Ks              uniform 0.005; // 草方格沙障
        Cs              uniform 1.0;
        value           uniform 0;           
    }
    
    frontAndBack
    {
        //type            empty;
        type            nutkWallFunction;
        value           uniform 0;

    }
    


    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
