CCB_RANS1_1_10ms/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//#include        "include/initialConditions"

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 1.15;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1.15;
    }

    outlet
    {
        type            zeroGradient;
    }

    top
    {
        type            zeroGradient;
    }
    
    bottom
    {
        type            omegaWallFunction;
        value           uniform 1.15;
    }
    
    CB
    {
        type            omegaWallFunction;
        value           uniform 1.15;
    }
    
    frontAndBack
    {
        //type            empty;
        type            zeroGradient;
    }
    
}


// ************************************************************************* //
