CCB_RANS1_1_10ms/system/refineMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      refineMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


set           c0;

coordinateSystem global;

globalCoeffs
{
    tan1       (1 0 0);
    tan2       (0 1 0);
 //   tan3       (0 0 1);
}

directions
(
    tan1
    tan2
    normal
);

useHexTopology    no;

geometricCut    yes;

writeMesh    no;


// ************************************************************************* //
