CCB_RANS1_1_10ms/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

blockMesh
surfaceFeatures

snappyHexMesh -overwrite

simpleFoam 

touch SCB_test.foam
#------------------------------------------------------------------------------
